---
type: IOnLocalLinkSharedCoordinatesSavedCallback
namespace: Autodesk.Revit.DB
version: 2024
members: 1
tags: [revit-api, class]
---

# IOnLocalLinkSharedCoordinatesSavedCallback

`Autodesk.Revit.DB.IOnLocalLinkSharedCoordinatesSavedCallback` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | OnLocalLinkSharedCoordinatesSaved | 2015 | `void OnLocalLinkSharedCoordinatesSaved ( ExternalResourceReference changedResource )` |